content/book/introduction.md
+++
title = "Introduction"
author = ["Hans Pistor"]
date = 2020-03-18T00:00:00-04:00
draft = false
+++

## Designing and Analyzing Algorithms {#designing-and-analyzing-algorithms}


### [Chapter 1]({{< relref "chapter_1" >}}) {#chapter-1--chapter-1-dot-md}

-    Overview of Algorithms and their place in modern computing systems


### [Chapter 2]({{< relref "chapter_2" >}}) {#chapter-2--chapter-2-dot-md}

-    First algorithms

    -    Sorting a sequence of n numbers

-    Determining runtimes of algorithms


### Chapter 3 {#chapter-3}

-    Defines asymptotic notation

-    Mathamatic notation


### Chapter 4 {#chapter-4}

-    Divide and Conquer

-    Strassens method for multipling matrices

-    master method


### Chapter 5 {#chapter-5}

-    Probablistic analysis

    -    Used to determine run time of algorithm with probability distribution

-    Randomized algorithms

    -    Enforce a probability distribution on inputs
